OpenFOAM-2112/shitzDaily/0.model/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(fixedWalls|fixedWalls2)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "(atmosphere1|atmosphere2)"
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }

    symmetry
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
