OpenFOAM-2112/shitzDaily/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue s 0
);

regions
(
    boxToCell
    {
        box ( -100 -100 0 ) ( 100 100 0.27 );
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue s 0
        );
    }

    boxToCell
    {
        box ( -100 -100 -0.30 ) ( 0.28 100 -0.178 );
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue s 1
        );
    }

    boxToCell
    {
        box ( 0.22 -100 -100 ) ( 100 100 -0.26 );
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue s 0
        );
    }
);


// ************************************************************************* //
